rack# ./bcm.user
sal_config_refresh: unknown entry "pp_clock_frequency" on configFb6.bcm line 9
sal_config_refresh: unknown entry "management_port_mode" on configFb6.bcm line 12
Broadcom Command Monitor: Copyright (c) 1998-2020 Broadcom
Release: sdk-6.5.20 built 20200505 (Tue May  5 12:14:12 2020)
From sr936857@xl-blr-06:/projects/ntsw-sw7/home/sr936857/git-code/sdk6/sdk
Platform: X86
OS: Unix (Posix)
DMA pool size: 33554432
BDE dev 0 (PCI), Dev 0xb470, Rev 0x01, Chip BCM56470_A0, Driver BCM56470_A0
line card number  = 1 on Port 1: 
line card number  = 2 on Port 5: 
line card number  = 3 on Port 9: 
line card number  = 4 on Port 13: 
SOC unit 0 attached to PCI device BCM56470_A0
WARNING: bcm esw command CoupledMemWrite not alphabetized
Boot flags: Cold boot
rc: unit 0 device BCM56470_A0
Loading M0 Firmware located at BP3-Broadcom_CSG_HW-License-48.BCM56470AA0_A0.21436587badcfe00.bin
HLA: Error: Unable to open file: BP3-Broadcom_CSG_HW-License-48.BCM56470AA0_A0.21436587badcfe00.bin
line card number  = 1 on Port 1: 
line card number  = 2 on Port 5: 
line card number  = 3 on Port 9: 
line card number  = 4 on Port 13: 
open /dev/linux-bcm-knet: : No such file or directory
Loading M0 Firmware located at ../../../../rc/cmicfw/linkscan_led_fw.bin
Firmware download successed (0x4e0f5528).
Loading M0 Firmware located at ../../../../rc/cmicfw/custom_led.bin
Firmware download successed (0x4bc6bdc6).
0:soc_avs_openloop_main: Fail to init VRM !
UNIT0 CANCUN: 
	CIH: LOADED
	Ver: 03.00.07

	CMH: LOADED
	Ver: 03.00.07
	SDK Ver: 06.05.20

	CCH: LOADED
	Ver: 03.00.07
	SDK Ver: 06.05.20

	CEH: LOADED
	Ver: 03.00.07
	SDK Ver: 06.05.20

	CFH: LOADED
	Ver: 03.00.07

rc: MMU initialized
rc: BCM driver initialized
rc: L2 Table shadowing enabled
rc: Port modes initialized
BCM.0> 
BCM.0> 
BCM.0> 
BCM.0> cd cint
BCM.0> 
BCM.0> 
BCM.0> cint coe_svtag.c
int ARGC = 0 (0x0)
int opt_IsTestConfig = 0 (0x0)
Using preferred port 1
Using preferred port 5
Using preferred port 17
Using preferred port 13
int ing_port1 = 1 (0x1)
int ing_port2 = 5 (0x5)
int non_coe_port1 = 17 (0x11)
int coe_port1 = 13 (0xd)
execute(): Start
Doing vlan create 100...
Doing vlan port add...
Doing vlan create 101...
Doing vlan port add...
Doing L3 intf create...
Doing L3 egress create...
Doing L3 route add...
nexthop created with index0  =  100002
Doing stk modid add...
Doing port ctrl set SubportTagEnable...port=13
Doing gport get...
Doing subport group create...
int subport_group_gport = 487332352 (0x1d0c1a00)
Doing subport port add...
int $$ = 587203200 (0x23000280)
Doing port vlan membership set...
Doing port vlan membership set for vlan= 101 
Doing flow handle get...
Doing flow option id get...
Doing flow encap add...
Doing efp group create...
Doing efp entry create...
int entry = 1 (0x1)
Doing qualify EgressPortCtrlType...
Doing action add SubportSvtagSignature...
Doing action add SubportSvtagPrio...
Doing action add SubportSvtagEnable...
Doing entry install...
Doing L3 intf create...
Doing L3 egress create...
Doing L3 route add...
nexthop created with index1  =  100004
##########   Sending L3 packet 0 ########
B_CM.0> tx 1 pbm=17 data=0000000000DD0000000000CC810000640800450000460000000040111A461010101120202021111122220036C6B0000102030405060708090A0B0C0D0E0F101112131415161718191A1B1C1D1E1F202122232425262728292A2B2C2D2
Packet from data=<>, length=96
B_CM.0> sleep quiet 1
[bcmPW.0]
[bcmPW.0]Packet[1]: data[0000]: {0000000000dd} {0000000000cc} 8100 0064
[bcmPW.0]Packet[1]: data[0010]: 0800 4500 0046 0000 0000 4011 1a46 1010 
[bcmPW.0]Packet[1]: data[0020]: 1011 2020 2021 1111 2222 0036 c6b0 0001 
[bcmPW.0]Packet[1]: data[0030]: 0203 0405 0607 0809 0a0b 0c0d 0e0f 1011 
[bcmPW.0]Packet[1]: data[0040]: 1213 1415 1617 1819 1a1b 1c1d 1e1f 2021 
[bcmPW.0]Packet[1]: data[0050]: 2223 2425 2627 2829 2a2b 2c2d 4f01 1d73 
[bcmPW.0]Packet[1]: length 96 (96). rx-port 17. cos 0. prio_int 0. vlan 100. reason 0x1. Outer tagged.
[bcmPW.0]Packet[1]: dest-port 0. dest-mod 5. src-port 17. src-mod 0. opcode 1.  matched 222. classification-tag 0.
[bcmPW.0]Packet[1]: reasons: FilterMatch
[bcmPW.0]
[bcmPW.0]Packet[2]: data[0000]: {0000000000aa} {0000000000ee} 1300 040b
[bcmPW.0]Packet[2]: data[0010]: 8100 0065 0800 4500 0046 0000 0000 3f11 
[bcmPW.0]Packet[2]: data[0020]: 1b46 1010 1011 2020 2021 1111 2222 0036 
[bcmPW.0]Packet[2]: data[0030]: c6b0 0001 0203 0405 0607 0809 0a0b 0c0d 
[bcmPW.0]Packet[2]: data[0040]: 0e0f 1011 1213 1415 1617 1819 1a1b 1c1d 
[bcmPW.0]Packet[2]: data[0050]: 1e1f 2021 2223 2425 2627 2829 2a2b 2c2d 
[bcmPW.0]Packet[2]: data[0060]: f892 53da 
[bcmPW.0]Packet[2]: length 100 (100). rx-port 13. cos 0. prio_int 0. vlan 101. reason 0x1. Outer tagged.
[bcmPW.0]Packet[2]: dest-port 0. dest-mod 0. src-port 13. src-mod 0. opcode 0.  matched 223. classification-tag 0.
[bcmPW.0]Packet[2]: reasons: FilterMatch
#####################################################

bcm_error_t $$ = BCM_E_NONE (0)
execute(): End
BCM.0> 
BCM.0> 
BCM.0> 
BCM.0> fp show
FP:	unit 0:
PIPELINE STAGE AGGREGATE_EGRESS_FLOWTRACKER
FP:	      :tcam_sz=1023(0x3ff), tcam_slices=1, tcam_ext_numb=0,
PIPELINE STAGE AGGREGATE_MMU_FLOWTRACKER
FP:	      :tcam_sz=1023(0x3ff), tcam_slices=1, tcam_ext_numb=0,
PIPELINE STAGE FLOWTRACKER
FP:	      :tcam_sz=3064(0xbf8), tcam_slices=2, tcam_ext_numb=0,
PIPELINE STAGE EXACTMATCH
FP:	      :tcam_sz=32768(0x8000), tcam_slices=2, tcam_ext_numb=0,
PIPELINE STAGE INGRESS
FP:	      :tcam_sz=36864(0x9000), tcam_slices=18, tcam_ext_numb=0,
PIPELINE STAGE EGRESS
FP:	      :tcam_sz=12288(0x3000), tcam_slices=4, tcam_ext_numb=0,
PIPELINE STAGE LOOKUP
FP:	      :tcam_sz=2048(0x800), tcam_slices=4, tcam_ext_numb=0,
GID       9999: gid=0x270f, instance=0 mode=Single, stage=Ingress lookup=Enabled, ActionResId={-1}, pbmp={0x00000000000000000000000000000000000000000000001e2222222222222223}
         qset={InPort, Stage},
         aset={CopyToCpu, PolicerGroup, StatGroup},

         group_priority= -9999
         slice_primary =  {slice_number=1, Entry count=2048(0x800), Entry free=2047(0x7ff)},
         group_status={prio_min=-2147483647, prio_max=2147483647, entries_total=34816, entries_free=34815,
                       counters_total=57344, counters_free=55295, meters_total=6144, meters_free=6144}
EID 0x0000270f: gid=0x270f,
         slice=1, slice_idx=0, part =0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1

 InPort 
    Part:0 Offset0: 16 Width0:   4 
    Part:0 Offset1: 36 Width1:   4 
    DATA=0x0000000d 
    MASK=0x000000ff 
         action={act=CopyToCpu, param0=1(0x1), param1=223(0xdf), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 9999  slice = 9 idx=3 entries=1}{Packets}{Bytes}
         Extended statistics=NULL
GID       9998: gid=0x270e, instance=0 mode=Single, stage=Ingress lookup=Enabled, ActionResId={-1}, pbmp={0x00000000000000000000000000000000000000000000001e2222222222222223}
         qset={InPort, Stage},
         aset={CopyToCpu, PolicerGroup, StatGroup},

         group_priority= -9998
         slice_primary =  {slice_number=0, Entry count=2048(0x800), Entry free=2047(0x7ff)},
         group_status={prio_min=-2147483647, prio_max=2147483647, entries_total=34816, entries_free=34815,
                       counters_total=57344, counters_free=55295, meters_total=6144, meters_free=6144}
EID 0x0000270e: gid=0x270e,
         slice=0, slice_idx=0, part =0, prio=0, flags=0x810602, Installed, Enabled, color_indep=1

 InPort 
    Part:0 Offset0: 16 Width0:   4 
    Part:0 Offset1: 36 Width1:   4 
    DATA=0x00000011 
    MASK=0x000000ff 
         action={act=CopyToCpu, param0=1(0x1), param1=222(0xde), param2=0(0), param3=0(0)}
         policer=
         statistics={stat id 9998  slice = 8 idx=3 entries=1}{Packets}{Bytes}
         Extended statistics=NULL
GID          1: gid=0x1, instance=0 mode=Single, stage=Egress lookup=Enabled, ActionResId={-1}, pbmp={0x00000000000000000000000000000000000000000000001e2222222222222223}
         qset={StageEgress, EgressPortCtrlType},
         selcodes[0]=
{
         FPF3=KEY4
         Intraslice=Primary slice.
 {StageEgress->EgressPortCtrlType},

         group_priority= 500
         slice_primary =  {slice_number=0, Entry count=3072(0xc00), Entry free=3071(0xbff)},
         group_status={prio_min=-2147483647, prio_max=2147483647, entries_total=12288, entries_free=12287,
                       counters_total=12288, counters_free=12288, meters_total=12288, meters_free=12288}
EID 0x00000001: gid=0x1,
         slice=0, slice_idx=0, part =0 prio=0, flags=0xa10602, Installed, Enabled
              tcam: color_indep=1, 
 StageEgress 
 EgressPortCtrlType 
    Offset0: 260 Width0: 8 
    DATA=0x00000012 
    MASK=0x000000ff 
         action={act=SubportSvtagEnable, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=SubportSvtagPrio, param0=0(0), param1=0(0), param2=0(0), param3=0(0)}
         action={act=SubportSvtagSignature, param0=19(0x13), param1=0(0), param2=0(0), param3=0(0)}
         policer=
         statistics=NULL
         Extended statistics=NULL
BCM.0> 
BCM.0> 
BCM.0> 
BCM.0> ps
                 ena/        speed/ link auto    STP                  lrn  inter   max   cut   loop
           port  link  Lns   duplex scan neg?   state   pause  discrd ops   face frame  thru?  back
       ce0(  1)  up     4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284         MAC
       ce1(  5)  up     4  100G  FD   SW  No   Forward  TX RX    All   FA  CAUI4 12284         MAC
       ce2(  9)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       ce3( 13)  up     4  100G  FD   SW  No   Forward  TX RX    All   FA  CAUI4 12284         MAC
       ce4( 17)  up     4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284         MAC
       ce5( 21)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       ce6( 25)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       ce7( 29)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       ce8( 33)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       ce9( 37)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce10( 41)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce11( 45)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce12( 49)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce13( 53)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce14( 57)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
      ce15( 61)  down   4  100G  FD   SW  No   Forward  TX RX   None   FA  CAUI4 12284            
       xe0( 65)  down   1   25G  FD   SW  No   Forward  TX RX   None   FA     CR 12284            
       xe1( 66)  down   1   25G  FD   SW  No   Forward  TX RX   None   FA     CR 12284            
       xe2( 67)  down   1   25G  FD   SW  No   Forward  TX RX   None   FA     CR 12284            
       xe3( 68)  down   1   25G  FD   SW  No   Forward  TX RX   None   FA     CR 12284            
BCM.0> 
BCM.0> 
BCM.0> show c
MC_PERQ_PKT(0).cpu0	    :			  2		     +2
MC_PERQ_BYTE(0).cpu0	    :			196		   +196
RUC_64.ce3		    :			  1		     +1
ING_NIV_RX_FRAMES_VL.ce3    :			  1		     +1
TDBGC4_64.ce3		    :			  1		     +1
R127.ce3		    :			  1		     +1
RPKT.ce3		    :			  1		     +1
RUCA.ce3		    :			  1		     +1
RPRM.ce3		    :			  1		     +1
RPOK.ce3		    :			  1		     +1
RBYT.ce3		    :			100		   +100
T127.ce3		    :			  1		     +1
TPOK.ce3		    :			  1		     +1
TPKT.ce3		    :			  1		     +1
TUCA.ce3		    :			  1		     +1
TBYT.ce3		    :			100		   +100
RPROG2.ce3		    :			  1		     +1
UC_PERQ_PKT(0).ce3	    :			  1		     +1
UC_PERQ_BYTE(0).ce3	    :			100		   +100
RIPC4_64.ce4		    :			  1		     +1
RUC_64.ce4		    :			  1		     +1
ING_NIV_RX_FRAMES_VL.ce4    :			  1		     +1
R127.ce4		    :			  1		     +1
RPKT.ce4		    :			  1		     +1
RUCA.ce4		    :			  1		     +1
RPRM.ce4		    :			  1		     +1
RVLN.ce4		    :			  1		     +1
RPOK.ce4		    :			  1		     +1
RBYT.ce4		    :			 96		    +96
T127.ce4		    :			  1		     +1
TPOK.ce4		    :			  1		     +1
TPKT.ce4		    :			  1		     +1
TUCA.ce4		    :			  1		     +1
TVLN.ce4		    :			  1		     +1
TBYT.ce4		    :			 96		    +96
RPROG2.ce4		    :			  1		     +1
UC_PERQ_PKT(0).ce4	    :			  1		     +1
UC_PERQ_BYTE(0).ce4	    :			 96		    +96
BCM.0> 
BCM.0> 
BCM.0> 
BCM.0> 
BCM.0> ver
Broadcom Command Monitor: Copyright (c) 1998-2020 Broadcom
Release: sdk-6.5.20 built 20200505 (Tue May  5 12:14:12 2020)
From sr936857@xl-blr-06:/projects/ntsw-sw7/home/sr936857/git-code/sdk6/sdk
Platform: X86
OS: Unix (Posix)
Chips: BCM56504_A0, BCM56504_B0, BCM56314_A0, BCM56800_A0,
       BCM56514_A0, BCM56624_A0, BCM56624_B0, BCM56680_A0,
BCM.0> 
Interrupt:SIGINT 
BCM.0> 
BCM.0> 
BCM.0> a
Attach: Unit 0 (BCM56470_A0): attached (current unit)

+++++++++++++++++++++++
BCM.0> l3 intf show
Free L3INTF entries: 16380
Unit  Intf  VRF Group VLAN    Source Mac     MTU TTL Tunnel InnerVlan  NATRealm
------------------------------------------------------------------
0     1     10    0     100  00:00:00:00:00:dd  4096 0    0     0     0    
0     2     10    0     101  00:00:00:00:00:ee  4096 0    0     0     0    
+++++++++++++++++++++++

BCM.0> l3 egress show
Entry  Mac                 Vlan INTF PORT MOD MPLS_LABEL ToCpu Drop RefCount L3MC
100002  00:00:00:00:00:bb  100    1     1    0        -1   no   no    1   no
100004  00:00:00:00:00:aa  101    2     0    5        -1   no   no    1   no
+++++++++++++++++++++++

BCM.0> l3 defip show
Unit 0, Total Number of DEFIP entries: 12288
#     VRF     Net addr             Next Hop Mac        INTF MODID PORT PRIO CLASS HIT VLAN
3072  10       32.32.32.48/28       00:00:00:00:00:00 100002    0     0     0    0 n
3072  10       32.32.32.32/28       00:00:00:00:00:00 100004    0     0     0    0 y
+++++++++++++++++++++++
